doc/yajet-jquery.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>YAJET &ndash; JavaScript Template Engine (jQuery plugin)</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-05-30 12:26:42 CEST"/>
<meta name="author" content="Mihai Bazon"/>
<link rel="stylesheet" type="text/css" href="docstyle.css" />
</head><body>
<h1 class="title">YAJET &ndash; JavaScript Template Engine (jQuery plugin)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 The YAJET jQuery plugin </a>
<ul>
<li><a href="#sec-1.1">1.1 Initialization </a></li>
<li><a href="#sec-1.2">1.2 Compiling templates </a></li>
<li><a href="#sec-1.3">1.3 Using a different template source </a></li>
<li><a href="#sec-1.4">1.4 “Inline” templates </a></li>
</ul>
</li>
<li><a href="#sec-2">2 A more complicated example </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">1 The YAJET jQuery plugin </h2>
<div id="text-1">


<p>
Here are some short notes on the small interface for jQuery.  Please
read the <a href="./yajet.html">full documentation</a> for information about the features and
syntax of the YAJET template engine.
</p>
<p>
The jQuery plugin is just a thin wrapper that exposes a simple API.
For example:
</p>



<pre class="src src-espresso">
$(<span style="color: #bc8f8f;">"[yajet-template]"</span>).yajet({
    first_name: <span style="color: #bc8f8f;">"John"</span>,
    last_name: <span style="color: #bc8f8f;">"Doe"</span>,
    items: 5
});
</pre>




<p>
and the HTML code:
</p>



<pre class="src src-html">
&lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">yajet-template</span>=<span style="color: #bc8f8f;">"user"</span>&gt;&lt;/<span style="color: #0000ff;">div</span>&gt;

&lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"text/x-yajet"</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"user"</span>&gt;
  $this.first_name $this.last_name
  selected ${ this.items =&gt; plural(<span style="color: #bc8f8f;">"no items|one item|two items|# items"</span>)
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>




<p>
The “yajet” method looks for an attribute named “yajet-template”,
executes the template given the arguments and inserts the output into
the element.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">1.1 Initialization </h3>
<div id="text-1.1">


<p>
An YAJET object instance is automatically constructed, if you didn't
specify one, with all the default parameters.  If you need to do a
custom initialization, you can do the following when the document is
ready:
</p>



<pre class="src src-espresso">
$(document).ready(<span style="color: #a020f0;">function</span>(){
  $.yajet.init({
    reader_char: <span style="color: #bc8f8f;">"#"</span>,
    filters: { ...custom filters... }
  });
});
</pre>




<p>
The argument that you pass to <code>$.yajet.init</code> is directly passed to the
YAJET constructor.  See <a href="./yajet.html">the full YAJET documentation</a> for more
information on supported options.
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">1.2 Compiling templates </h3>
<div id="text-1.2">


<p>
The <code>init()</code> function will look for all <code>&lt;script&gt;</code> elements that have
a type="text/x-yajet" attribute, and will compile them automatically.
It interprets some additional attributes:
</p>
<ul>
<li>
name="foo" &mdash; if a name is given, the code within that &lt;script&gt; tag
will be EXPORT-ed.  If you don't specify a name attribute you should
EXPORT blocks yourself.

</li>
<li>
args="x, y" &mdash; arguments for the EXPORT-ed block (only when you
passed <code>name</code>).

</li>
</ul>

<p>As you can see in the first sample, you need to access template
arguments via the <code>this</code> keyword.  To provide some convenience the
plugin automatically wraps the blocks in "with(this){&hellip;}"  if you
append an asterisk character to the name.  So the first sample could
be:
</p>



<pre class="src src-html">
&lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">yajet-template</span>=<span style="color: #bc8f8f;">"user"</span>&gt;&lt;/<span style="color: #0000ff;">div</span>&gt;

&lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"text/x-yajet"</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"user*"</span>&gt;
  $first_name $last_name
  selected ${ items =&gt; plural(<span style="color: #bc8f8f;">"no items|one item|two items|# items"</span>)
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>




<p>
Just to be clear, it can also be written like this and it's perfectly
equivalent:
</p>



<pre class="src src-html">
&lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"text/x-yajet"</span>&gt;
$(EXPORT user()
  $(WITH (this)
    $first_name $last_name
    selected ${ items =&gt; plural(<span style="color: #bc8f8f;">"no items|one item|two items|# items"</span>)
  $)
$)
&lt;/<span style="color: #0000ff;">script</span>&gt;
</pre>




<p>
Here I manually exported the block, and added the <code>WITH(this)</code>
explicitly.  The difference is that in the last example I can write
multiple <code>EXPORT</code> blocks; if you use the <code>name</code> attribute, then you
should provide a different <code>&lt;script&gt;</code> for each block.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">1.3 Using a different template source </h3>
<div id="text-1.3">


<p>
If you prefer to write the templates in some element other than
<code>&lt;script&gt;</code>, you can call <code>$(selector).yajet_compile()</code> in order to
compile them manually.  The YAJET plugin tries the following methods
in order to fetch the template code:
</p>
<ol>
<li>
See if the first child is a comment or CDATA section, in which case
fetch its content.  This is the most convenient after <code>&lt;script&gt;</code>.

</li>
<li>
Try <code>$(this).val()</code> and if it returns something use that instead.
This is useful when you pass the template in a hidden field or
textarea&mdash;it can be convenient when you're assembling the final
HTML on the server side, since you need to HTML-encode the
template.

</li>
<li>
Otherwise use <code>$(this).html()</code>.  This is not safe because the
browser will mess with your code (if you need to use i.e. a &lt; b,
then it won't work since the sign will have been converted to
“&amp;lt;” already).  But for simple cases it might be convenient.

</li>
</ol>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4">1.4 “Inline” templates </h3>
<div id="text-1.4">


<p>
It's sometimes convenient to include the template literally in the
element where you want it to appear, rather than export it in a
<code>&lt;script&gt;</code>.  In this case, just don't pass the “yajet-template”
attribute and our plugin will figure out that you want to process the
inline template.
</p>
<p>
Note that the template of some element is compiled only once, the
first time it's rendered.  On subsequent invocations our plugin will
reuse the compiled function.
</p>
<p>
See the code in the next section for an example of this.
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2 A more complicated example </h2>
<div id="text-2">





<pre class="src src-nxml">
&lt;<span style="color: #0000ff;">html</span>&gt;
  &lt;<span style="color: #0000ff;">head</span>&gt;
    &lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">src</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">... load jquery.js</span><span style="color: #bc8f8f;">"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
    &lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">src</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">... load yajet.js</span><span style="color: #bc8f8f;">"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
    &lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">src</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">... load yajet-jquery.js</span><span style="color: #bc8f8f;">"</span>&gt;&lt;/<span style="color: #0000ff;">script</span>&gt;
    &lt;<span style="color: #0000ff;">script</span>&gt;
      var data = {
        links: [
          { url: "/about", text: "About" },
          { url: "/download", text: "Download" },
          { url: "/contact", text: "Contact" }
        ]
      };
      $(document).ready({
        $(".tmpl").yajet(data);
      });
    &lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;/<span style="color: #0000ff;">head</span>&gt;
  &lt;<span style="color: #0000ff;">body</span>&gt;
    &lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">tmpl navigation</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">yajet-template</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">navigation</span><span style="color: #bc8f8f;">"</span>&gt;&lt;/<span style="color: #0000ff;">div</span>&gt;

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> the following uses an inline template </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">tmpl</span><span style="color: #bc8f8f;">"</span>&gt;

      $(WRAP section("Links")
        &lt;<span style="color: #0000ff;">p</span>&gt;We have the following links:&lt;/<span style="color: #0000ff;">p</span>&gt;
        $(PROCESS navigation())
        &lt;<span style="color: #0000ff;">p</span>&gt;Foo bar.&lt;/<span style="color: #0000ff;">p</span>&gt; $)

      $(WRAP section("Info")
        &lt;<span style="color: #0000ff;">p</span>&gt;Blah blah&lt;/<span style="color: #0000ff;">p</span>&gt; $)

    &lt;/<span style="color: #0000ff;">div</span>&gt;

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> templates follow </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">text/x-yajet</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">navigation*</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #0000ff;">ul</span>&gt;
        $(FOREACH (links)
          &lt;<span style="color: #0000ff;">li</span>&gt;
            &lt;<span style="color: #0000ff;">a</span> <span style="color: #b8860b;">href</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">$url|html</span><span style="color: #bc8f8f;">"</span>&gt;$text|html&lt;/<span style="color: #0000ff;">a</span>&gt;
          &lt;/<span style="color: #0000ff;">li</span>&gt; $)
      &lt;/<span style="color: #0000ff;">ul</span>&gt;
    &lt;/<span style="color: #0000ff;">script</span>&gt;

    &lt;<span style="color: #0000ff;">script</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">text/x-yajet</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">section</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">args</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">title</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">section</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">title</span><span style="color: #bc8f8f;">"</span>&gt;$title|html&lt;/<span style="color: #0000ff;">div</span>&gt;
        &lt;<span style="color: #0000ff;">div</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">body</span><span style="color: #bc8f8f;">"</span>&gt;$(CONTENT)&lt;/<span style="color: #0000ff;">div</span>&gt;
      &lt;/<span style="color: #0000ff;">div</span>&gt;
    &lt;/<span style="color: #0000ff;">script</span>&gt;
  &lt;/<span style="color: #0000ff;">body</span>&gt;
&lt;/<span style="color: #0000ff;">html</span>&gt;
</pre>




<p>
For full information about the template syntax please read the <a href="./yajet.html">YAJET documentation</a>.
</p></div>
</div>
<div id="postamble"><p class="author"> Author: Mihai Bazon
<a href="mailto:mihai.bazon@gmail.com">&lt;mihai.bazon@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2010-05-30 12:26:42 CEST</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
